app/controllers/users_controller.rb

INSERT INTO `users` (`last_login_at`, `last_request_at`, `updated_at`, `crypted_password`, `single_access_token`, `perishable_token`, `current_login_ip`, `password_salt`, `current_login_at`, `failed_login_count`, `persistence_token`, `login_count`, `email`, `last_login_ip`, `created_at`) VALUES(NULL, '2010-01-31 02:16:44', '2010-01-31 02:16:44', '90dba6b45c38ef2a5ca3ed253619935df874fe6ed053b54f058a389f32f4445277f6ee8674a149d4f393ab0c6e2f05260f64491bc3ab0e23dd0f2cb1bcdbc48e', 'vSTN1ptM5ajftUbIc9b5', '0a1EKuOfO-fvpYr2P8ZT', '127.0.0.1', 'cis62hcQ8lk3kM0mx48I', '2010-01-31 02:16:44', 0, 'b82153288185c91eb76a310729af87917fe15a271ca8f94f2303b3f3059046704200d84ffca805c1330dc560f01a2fa2016e9526261b33cca73c222dc56ee270', 1, 'jamboni@rolo.com', NULL, '2010-01-31 02:16:44')
---
  def create
    @user = User.new(params[:user])
    if @user.save